[
    {
        "name": "Network Stack Tester (NeST)",
        "description": "We are a team of students from NITK Surathkal working on this project under the guidance of Dr. Mohit P. Tahiliani. The main idea is to use Linux network namespaces and provide APIs to create complex emulated networks, run tests and extract the statistics using iproute2 and netperf in a single python script."
    },
    {
        "name": "COSH NITK",
        "description": "Centre for Open-source Software and Hardware at NITK Surathkal, India is a center that aims to foster the adoption of open-source software and hardware for multi-disciplinary research, education, and product development."
    },
    {
        "name": "CSD NITK",
        "description": "Centre for System Design (CSD) NITK Surathkal, India is a center that aims at facilitating and providing required environment for all the key components of system design. Modern engineering problems are comprised of elements from all the traditional disciplines and these elements must be integrated to meet the overall design objectives. The Centre focuses on how to address and solve problems that transcend traditional boundaries."
    },
    {
        "name": "IEEE NITK",
        "description": "IEEE is the world's largest professional association advancing innovation and technological excellence for the benefit of humanity.  IEEE is the trusted \"voice\" for engineering, computing and technology information around the globe. IEEE NITK, belongs to the Region 10 of IEEE and under Bangalore section. Founded in 1988, we are an award winning student branch and one of the biggest world wide."
    },
    {
        "name": "IE NITK",
        "description": "Institution of Engineers, NITK Chapter, is one of the six exclusive clubs in NITK. We are divided by three core Special Interest Groups (SIGs) - Code, Gadget and Garage; but united by five auxiliary SIGs - Vriddhi, our social initiative, Script, our literary SIG, Robotics, Business and Tectonic, our newest SIG for Civil and Architecture."
    },
    {
        "name": "ACM NITK",
        "description": "ACM NITK is the student chapter of the Association for Computing Machinery’s (ACM) international community located in NITK Surathkal. We are home to 150 motivated students with a wide array of interests ranging from technical to business as well as creative pursuits."
    },
    {
        "name": "WebClub NITK",
        "description": "Web Enthusiasts' Club NITK is a group of Computer Science enthusiasts trying to help the community of NITK."
    },
    {
        "name": "IRIS NITK",
        "description": "We are a team of motivated students from NITK Surathkal, developing and expanding a digital portal that ensures that all administrative, academic and alumni related procedures take place methodically. The team has successfully migrated a number of functions which were earlier pen-and-paper procedures (including Admissions, Placements and Course Management), as modules in the system with the aim of integrating all such procedures onto this fully functioning unified system. IRIS is compatible across various software platforms and ensures security of data with strong encryption and a data protection policy in place."
    },
    {
        "name": "CRF NITK",
        "description": "Central Research Facility is a HEFA Funded R&D Lab at NITK"
    },
    {
        "name": "Miscellaneous",
        "description": "Projects that are not under any organizations. These are projects maintained by individuals or independent groups of people."
    }
]