[
    {
        "mentors": [
            {
                "email": "tahiliani@nitk.edu.in",
                "name": "Dr. Mohit P. Tahiliani"
            },
            {
                "email": "govindJeevan7@gmail.com",
                "name": "Govind Jeevan"
            }
        ],
        "title": "Develop a website for COSH",
        "org": "COSH NITK",
        "summary": "Centre for Open-source Software and Hardware (COSH) aims to promote and encourage multi-disciplinary research, education, and development in open-source software and hardware (open to all disciplines of Science and Engineering). The main goal of this project is to build a website for COSH.",
        "url": "https://drive.google.com/open?id=1gDWx3VEIRi8tQwMhcs-o-pJ4tpV_5L0rqwnmtE1WiVY",
        "students": [],
        "openToAll": true
    },
    {
        "mentors": [
            {
                "email": "adityachirania.181co104@nitk.edu.in",
                "name": "Aditya Chirania"
            },
            {
                "email": "niranjansy.181co136@nitk.edu.in",
                "name": "Niranjan S Yadiyala"
            }
        ],
        "title": "Stronger test case management and Viewing problems in CodePal",
        "org": "IEEE NITK",
        "summary": "CodePal is a Visual Studio Code Extension to help Codeforces Users Code with Convenience. This extension is specially for people who want to save time in a live codeforces contest and upsolve problems comfortably. It has over 2.3k downloads to date and counting.  \n\nThe current CodePal extension has features to compile and run code against test cases, and also add test cases. But what it lacks is the ability to run selected test cases only and delete certain tests. Also currently it only gives verdicts about whether the test passed, failed or timed out, but it would be nice to provide comprehensive details of each test’s run including the time taken and memory utilized.",
        "url": "https://drive.google.com/open?id=19S7ORk-MrOXbEb33NRI4iCGk8qtZEhpvwopYEkrq6C4",
        "students": [],
        "openToAll": true
    },
    {
        "mentors": [
            {
                "email": "nest@nitk.edu.in",
                "name": "Shanthanu S Rai"
            },
            {
                "email": "tahiliani@nitk.edu.in",
                "name": "Dr. Mohit P. Tahiliani"
            }
        ],
        "title": "Develop an API to support gnuplot in NeST",
        "org": "NeST",
        "summary": "NeST is a python3 package that handles testbed setup, testbed configuration, collecting and visualizing data by providing a user friendly API, addressing common issues involved in conducting networking experiments. NeST provides ‘.png’ plots for users to visualize the networking parameters.  \n\nThese plots quickly provide important information about the network. But at times there is a need for high quality plots with user chosen plotting parameters. For this, we want NeST to generate “.dat” files. Using this file, users can use a popular plotting tool ‘gnuplot’ to generate customized plots.",
        "url": "https://drive.google.com/open?id=1GlVXxZ0nml0RQOXXWAINLtjrRwLxvgq6Fav21hrGLEY",
        "students": [],
        "openToAll": true
    },
    {
        "mentors": [
            {
                "email": "tahiliani@nitk.edu.in",
                "name": "Dr. Mohit P. Tahiliani"
            }
        ],
        "title": "Migration of RTLabs website",
        "org": "CSD NITK",
        "summary": "Remote Triggered Labs (http://rtlabs.nitk.ac.in/) at Centre for System Design (CSD), NITK Surathkal are funded by the Ministry of Education, Government of India. These labs allow the users to remotely perform engineering experiments over the Internet by using a web interface.  \n\nThe website for RTLabs is hosted in Central Computer Centre (CCC) at NITK, but is running on an old server machine. This project aims to migrate the RTLabs website to a new container which will be provided to the student. Subsequently, we need to test the working of the website once it is migrated to a new container. Lastly, this project also aims to set up a git repository for RTLabs (currently, the source code of RTLabs is not stored in a git repository).",
        "url": "https://drive.google.com/open?id=1SghaX2N34kiKBop1AbzMFxdwhYXhFpq1zhkXOyaBgn8",
        "students": [],
        "openToAll": false
    },
    {
        "mentors": [
            {
                "email": "adityachirania.181co104@nitk.edu.in",
                "name": "Aditya Chirania"
            },
            {
                "email": "niranjansy.181co136@nitk.edu.in",
                "name": "Niranjan S Yadiyala"
            }
        ],
        "title": "Automatic Code Submission for Codeforces Problems from CodePal",
        "org": "IEEE NITK",
        "summary": "CodePal is a Visual Studio Code Extension to help Codeforces Users Code with Convenience. This extension is specially for people who want to save time in a live codeforces contest and solve problems comfortably. This extension responds quickly to users. It makes use of the Codeforces public API and the VS Code Extension API, and can swiftly filter through the problem list by specifying tags and ratings, create folders for contests and problems containing sample tests of each problem, and compile and run tests automatically on the user’s code.  \n\nCodePal currently has a feature whereby, on the click of a button, the user’s code gets copied onto the clipboard and the submission page of the problem is opened on the user’s default browser. The user then has to paste the code and click on ‘Submit’ on the webpage. The objective of this project is to make the process of submission of a problem even faster, by being able to submit the code directly from CodePal itself through the click of a single button. This feature has been implemented by a few other tools such as Catalyst, Competitive Companion etc. and we wish to draw inspiration from the same and come up with an optimized implementation.",
        "url": "https://drive.google.com/open?id=15nDCO5If-bN5t3alYm2roBY7E2DKW24SNYTAuvv9LRE",
        "students": [],
        "openToAll": true
    },
    {
        "mentors": [
            {
                "email": "harshithasridhar172000@gmail.com",
                "name": "Harshitha S"
            },
            {
                "email": "rmhanchate2000@gmail.com",
                "name": "Rahul Hanchate"
            }
        ],
        "title": "Fixing bugs in OpenRISC CPU",
        "org": "",
        "summary": "Mor1kx CPU is one of the most sophisticated and reconfigurable OpenRISC processors with various architectural implementations. Formal Verification of Mor1kx Processor identified a few unseen bugs that should be resolved. Bugs can be fixed by modifying the RTL code of the processor without deviating from the actual specifications of the processor. Bug fixes must pass both or1k-tests as well as formal tests applicable to it.",
        "url": "https://drive.google.com/open?id=1nTTdgWDCl6p-re8B8mUWuh0-sBxe_hNzTPU87FiyfgE",
        "students": [],
        "openToAll": false
    },
    {
        "mentors": [
            {
                "email": "samarthmayya.191cs152@nitk.edu.in",
                "name": "Samarth Mayya"
            },
            {
                "email": "abhishek.181co201@nitk.edu.in",
                "name": "Abhishek Kumar"
            }
        ],
        "title": "Improvements to Bootcamp",
        "org": "IRIS NITK",
        "summary": "This project is about:  \n- Deploying a Jekyll website that uses MarkDown files containing the IRIS Bootcamp content, to Github Pages.  \n - Developing and deploying the various demo projects in the IRIS Bootcamp, to Heroku.  \n",
        "url": "https://drive.google.com/open?id=1nTTdgWDCl6p-re8B8mUWuh0-sBxe_hNzTPU87FiyfgE",
        "students": [],
        "openToAll": false
    },
    {
        "mentors": [
            {
                "email": "patidar.priyansh936@gmail.com",
                "name": "Priyansh Patidar"
            },
            {
                "email": "Utkarsh Mahajan",
                "name": "utkarshrm568@gmail.com"
            },
            {
                "email": "R S Muthukumar",
                "name": "rsmuthukumar.201ec149@nitk.edu.in"
            }
        ],
        "title": "ClubsCafe",
        "org": "",
        "summary": "Clubs Café is about creating a one-stop destination for various events and other club-related activities happening across different institutions in India.",
        "url": "https://drive.google.com/open?id=1AlCeXiBNf9AGU3rAaj7ySN5-nUMSKY5cvIsjkY-14Dg",
        "students": [],
        "openToAll": true
    },
    {
        "mentors": [
            {
                "email": "rao.sush004@gmail.com",
                "name": "Sushanth Sathesh Rao"
            }
        ],
        "title": "Improving RBS Toolchain",
        "org": "",
        "summary": "This project mainly aims to help students to start contributing to the open source repository of Ruby. Ruby has launched a new tool chain for static typing and requires contributions from the community to improve the tool chain.  \n\nRBS is the newly developed language for mentioning types in a Ruby program. RBS has undergone significant changes and is currently waiting for its next major release. RBS is quite stable currently, but still has great scope for improvements.",
        "url": "https://drive.google.com/open?id=1OY7NTdxPxruSwhb_8x0FkgunMCB_qvfx8JhVdAFJadM",
        "students": [],
        "openToAll": true
    },
    {
        "mentors": [
            {
                "email": "rakshit.191cs147@nitk.edu.in",
                "name": "Rakshit P"
            }
        ],
        "title": "Pharo Consortium",
        "org": "",
        "summary": "This project will help the mentees communicate with the Pharo Consortium organization, and work on open issues of their choice in the organization.",
        "url": "https://drive.google.com/open?id=1IAm8japH90ivXwdkUejLC3yTCpQETgJU3ATjVkY25pI",
        "students": [],
        "openToAll": true
    },
    {
        "mentors": [
            {
                "email": "namanmanishtrivedi@gmail.com",
                "name": "Naman Trivedi"
            },
            {
                "email": "rao.sush004@gmail.com",
                "name": "Sushanth Sathesh Rao"
            },
            {
                "email": "ashwinprasanna9@gmail.com",
                "name": "Ashwin P"
            }
        ],
        "title": "NITK Connect",
        "org": "WebClub NITK",
        "summary": "An application aimed at promoting information sharing and increasing connections between the students of our college. Has three primary modules.  \n\n*Connect*: Students can search and connect with each other, similar to linkedin.  \n*Blogs Module*: Students can publish blogs through the website to share knowledge or ask questions on any topic. Blogs can be searched using keywords or tags. Users can post comments in the comments section.  \n*Resource Hub*: A resource center that can be used by students to share and store important resources on any course.  \n*Auth Module*: This module handles the User authentication stuff like login signup, anonymous profile toggling between them etc. ",
        "url": "https://drive.google.com/open?id=1rjT9b6DNeBtu4MlMqtpM6BXg5W__-0mLjFEX8MK7IP8",
        "students": [],
        "openToAll": true
    },
    {
        "mentors": [
            {
                "email": "paranjayasaxena@gmail.com",
                "name": "Paranjaya Saxena"
            },
            {
                "email": "manasdtrivedi@gmail.com",
                "name": "Manas Trivedi"
            }
        ],
        "title": "MyDrive",
        "org": "IE NITK",
        "summary": "MyDrive is a storage solution for enterprises, similar to Google Drive. It is being built using Node.JS and uses the MongoDB database.",
        "url": "https://drive.google.com/open?id=1ncdlBJRSaHvdPNrJz-SW4NH8gkZ_enpeZrFh3AHpiLI",
        "students": [],
        "openToAll": true
    },
    {
        "mentors": [
            {
                "email": "riyashah.191cs244@nitk.edu.in",
                "name": "Riya Shah"
            },
            {
                "email": "diya.191it215@nitk.edu.in",
                "name": "Diya Gupta"
            }
        ],
        "title": "Github Scraper",
        "org": "IE NITK",
        "summary": "Github has a lot of informational content which isn’t easily visible to us. Sometimes the keywords we search for are hidden in the files of the repositories and doesn’t easily come up on Google. So this project creates a customised search engine which scrapes not only on the basis of titles but also based on the content in the repositories, eg. The Readme files, etc.",
        "url": "https://drive.google.com/open?id=1ZTgpNkPAAeN5q_ibsfnvOBlrTPBvVuvtUyVn12l2gw4",
        "students": [],
        "openToAll": true
    },
    {
        "mentors": [
            {
                "email": "ikjotsd.191cs123@nitk.edu.in",
                "name": "Ikjot Singh Dhody"
            },
            {
                "email": "rajanjaiswal.191ee235@nitk.edu.in",
                "name": "Rajan Jaiswal"
            }
        ],
        "title": "Feature additions to NITK Companion App",
        "org": "WebClub NITK",
        "summary": "The NITK Companion app is a project that was started with the aim to create a mobile application that can cater to the needs of anyone who will be staying at NITK or visiting NITK for that matter. We have all faced the situation where on admission day, the volunteers tell us to go to some building to get something done but we have no way to get there. Add to this the fact that there are multiple names by which buildings and locations are referred to (unofficially), making it hard to use google maps as well. We aim to solve this and other problems as well.  \n\nThe inspiration for the application came from the \"InstiApp\" of IITB which solves a similar problem, and we aim to develop a similar application for the community of NITK. So far, the application has a mess menu, events and maps features all of which have scope for further improvements. Applicants will be involved with developing new features for the application by creating custom flutter widgets.",
        "url": "https://drive.google.com/open?id=1eTB4XnTCqb-d",
        "students": [],
        "openToAll": false
    },
    {
        "mentors": [
            {
                "email": "ikjotsd.191cs123@nitk.edu.in",
                "name": "Ikjot Singh Dhody"
            },
            {
                "email": "rajanjaiswal.191ee235@nitk.edu.in",
                "name": "Rajan Jaiswal"
            }
        ],
        "title": "NITK Companion App Map Improvements",
        "org": "WebClub NITK",
        "summary": "The NITK Companion app is a project that was started with the aim to create a mobile application that can cater to the needs of anyone who will be staying at NITK or visiting NITK for that matter. We have all faced the situation where on admission day, the volunteers tell us to go to some building to get something done but we have no way to get there. Add to this the fact that there are multiple names by which buildings and locations are referred to (unofficially), making it hard to use google maps as well. We aim to solve this and other problems as well.  \n\nThe inspiration for the application came from the \"InstiApp\" of IITB which solves a similar problem, and we aim to develop a similar application for the community of NITK. So far, the application has a mess menu, events and maps features all of which have scope for further improvements. Applicants will be involved with enhancing the map based functionalities in this project.",
        "url": "https://drive.google.com/open?id=1xC07d4RzAAXw5xtHic6V_-xbK2lOCkacqMIdTAga_uI",
        "students": [],
        "openToAll": false
    },
    {
        "mentors": [
            {
                "email": "atreyamaj.181ec206@nitk.edu.in",
                "name": "Atreya Majumdar"
            }
        ],
        "title": "Adding DMPNN to Deepchem",
        "org": "",
        "summary": "This project aims to add a very important molecular machine learning model: DMPNN. DMPNN is a graph convolutional model used for molecular property prediction. The model utilizes a hybrid representation which combines both graph convolutions and molecular descriptors. The model thus learns to construct molecular encodings by using convolutions centred on intramolecular bonds, rather than the atoms. This avoids unnecessary loops during the message passing phase.",
        "url": "https://drive.google.com/open?id=1Nf9_1R30bTlYEf5Ix9JLuZU3dGUOR2tbpBooUBF3PXY",
        "students": [],
        "openToAll": true
    },
    {
        "mentors": [
            {
                "email": "sushanth.191ee156@nitk.edu.in",
                "name": "Sushanth Sathesh Rao"
            }
        ],
        "title": "iACM",
        "org": "ACM NITK",
        "summary": "ACM-NITK undertakes many projects and events during the calendar year and we plan on handling and managing them using the iACM APP. This project aims at building a Flutter based application which interacts with a remote backend server to implement the functionalities such as project management, event tracking, etc.",
        "url": "https://drive.google.com/open?id=1AsrMrsw3SoybC08qd840S2kCaPm1Rb59mb3A8_RgIwk",
        "students": [],
        "openToAll": true
    },
    {
        "mentors": [
            {
                "email": "kausthubtm.191it125@nitk.edu.in",
                "name": "Kausthub Thekke Madathil"
            },
            {
                "email": "nirmalvnair.191me251@nitk.edu.in",
                "name": "Nirmal V Nair"
            }
        ],
        "title": "iACM Website",
        "org": "ACM NITK",
        "summary": "ACM-NITK undertakes many projects and events during the calendar year and we plan on handling and managing them using the iACM APP. The iACM Website is the web version of the iACM App that is used to track and manage various events and activities that ACM NITK oversees. The project involves creating a Django + React application to meet the requirements. ",
        "url": "https://drive.google.com/open?id=1TeT-Ot5cMcrvVMqFCgOgyQfBBgidFkyInSVF5yvkRAc",
        "students": [],
        "openToAll": true
    },
    {
        "mentors": [
            {
                "email": "aritrasinha002@gmail.com",
                "name": "Aritra Sinha"
            },
            {
                "email": "diya.191it215@nitk.edu.in",
                "name": "Diya Gupta"
            },
            {
                "email": "ksakshithimmaiah.191it124@nitk.edu.in",
                "name": "K Sakshi Thimmaiah"
            }
        ],
        "title": "IMPRESARIO Backend",
        "org": "IE NITK",
        "summary": "Impresario is a Django web application using PostgreSQL as the database. It is created with the intent to keep track of organizations and their sub-organizations. It also keeps track of the members and the events organized under them. Every organization can branch out to have several other sub-organizations, and for each one, users can add/remove members, adjust the privileges, schedule events, etc. We use Google Calendar API to add events to the calendar and send invitations to participants.",
        "url": "https://drive.google.com/open?id=1CzxMDXEt_OgTn8pd7fDsZs5h8zarhuFZk-kftbRQsXU",
        "students": [],
        "openToAll": true
    },
    {
        "mentors": [
            {
                "email": "aritrasinha002@gmail.com",
                "name": "Aritra Sinha"
            },
            {
                "email": "diya.191it215@nitk.edu.in",
                "name": "Diya Gupta"
            },
            {
                "email": "ksakshithimmaiah.191it124@nitk.edu.in",
                "name": "K Sakshi Thimmaiah"
            }
        ],
        "title": "IMPRESARIO Frontend",
        "org": "IE NITK",
        "summary": "Impresario is a Django web application using PostgreSQL as the database. It is created with the intent to keep track of organizations and their sub-organizations. It also keeps track of the members and the events organized under them. Every organization can branch out to have several other sub-organizations, and for each one, users can add/remove members, adjust the privileges, schedule events, etc. We use Google Calendar API to add events to the calendar and send invitations to participants.",
        "url": "https://drive.google.com/open?id=1gTq6i5MHM_VHv8sqr8D3jCOWbvpFwyHNRTRK5t0k5oA",
        "students": [],
        "openToAll": true
    }
]